# Pandas Series

A series is a 1d labeled array capable of holding any data type. The axis labels are collectively called index.

### Creating  a series

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30,40,50,60])
d={1:10,2:20,7:30,4:40,5:50}

In [4]:
pd.Series(my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)    # cannot use 2d

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [6]:
pd.Series(d)

1    10
2    20
7    30
4    40
5    50
dtype: int64

# DATAFRAME

### Creating a dataframe

In [7]:
#using dictionary
data={
    'Name':['Komal','Vasu','Agriya','Sweety'],
    'Age':[21,20,19,20],
    'City':['Lucknow','Bikaner','Jammu','Kanpur'],
    'Salary':[65000,72000,85000,100000]
}
df=pd.DataFrame(data)
df

     Name  Age     City  Salary
0   Komal   21  Lucknow   65000
1    Vasu   20  Bikaner   72000
2  Agriya   19    Jammu   85000
3  Sweety   20   Kanpur  100000

In [8]:
#Using list
data_list=[
    ['Komal',21,'Gola',10000],
    ['Vasu',20,'Bikaner',12000],
    ['Agriya',19,'Jammu',12000],
    ['Sweety',21,'Kanpur',10000]
    
]
columns=['Name','Age','City','Salary']
df2=pd.DataFrame(data_list,columns=columns)
df2

     Name  Age     City  Salary
0   Komal   21     Gola   10000
1    Vasu   20  Bikaner   12000
2  Agriya   19    Jammu   12000
3  Sweety   21   Kanpur   10000

### Selection and indexing of columns

In [9]:
df2['Name']
df2[['City','Name']]

      City    Name
0     Gola   Komal
1  Bikaner    Vasu
2    Jammu  Agriya
3   Kanpur  Sweety

### Creating a new column

In [10]:
df2['Designation']=['Doctor','SE','Teacher','Youtuber']
df2

     Name  Age     City  Salary Designation
0   Komal   21     Gola   10000      Doctor
1    Vasu   20  Bikaner   12000          SE
2  Agriya   19    Jammu   12000     Teacher
3  Sweety   21   Kanpur   10000    Youtuber

### Removing column

In [12]:
df2.drop('Designation',axis=1)
# df2.drop(["Age","Designation"],axis=1)

     Name  Age     City  Salary
0   Komal   21     Gola   10000
1    Vasu   20  Bikaner   12000
2  Agriya   19    Jammu   12000
3  Sweety   21   Kanpur   10000

### Removing row

In [129]:
df2.drop(0,axis=0)

     Name  Age     City  Salary Designation
1    Vasu   20  Bikaner   12000          SE
2  Agriya   19    Jammu   12000     Teacher
3  Sweety   21   Kanpur   10000    Youtuber

### Selecting a row

In [130]:
df2.loc[1]
df2.loc[[0,1]]
df2.iloc[3]  #index loaction

Name             Sweety
Age                  21
City             Kanpur
Salary            10000
Designation    Youtuber
Name: 3, dtype: object

### selecting subsets of rows and columns

In [133]:
df2.loc[[0,1]][['City','Salary']]

      City  Salary
0     Gola   10000
1  Bikaner   12000

### Conditional Selection

In [ ]:
df2[df2['Age']>20]

df2[(df2["Age"]>20) & (df2["City"]=="Gola")]

    Name  Age  City  Salary Designation
0  Komal   21  Gola   10000      Doctor